<?php 
	$helpid = isset($_GET['id']) ? $_GET['id'] : 0;
?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Untitled Document</title>
<link href="style.css" rel="stylesheet" type="text/css" />
</head>

<body>
<div style="padding:5px;">
<div style="padding:5px; border:1px solid #CCC;">
<?php switch($helpid) {
	case 1 : ?>
<strong>ЗАКОНИ </strong><br />
  <span><br />
Базата  содржи  закони донесени од страна на Собранието на Република Македонија.</span><br />
<br />
Кога се врши пребарување по буква како почетна буква се смета првата буква од зборот кој доаѓа после зборовите Закон за ... <br />
<br />
Напредното пребарување вклучува пребарување по името на законот, пребарување по групата во која спаѓа конкретниот закон, како и број и година на Службениот весник во кој е објавен или по збор кој е содржан во текстот на законот. Пребарувањето може да се врши истовремено во сите полиња или може да се пребарува посебно во секое поле. Доколку пребарувањето се изврши без пополнување на полињата тогаш се прикажуваат сите закони кои ги содржи базата на податоци. </span> 
<?php break; ?>
<?php case 2: ?>
<strong>СУДСКА ПРАКСА</strong>   <br />
      <span><br />
      Моментално базата ја содржи судската пракса на Врховниот суд</span><span class="tekstBold"> од 1999 година</span><span>. <br>
      <br>
      За да може да се пребарува судската пракса најпрво мора да се избере името на судот чија судска пракса се пребарува. Одлуките, решенијата и пресудите на Уставниот и Врховниот суд може да се пребаруваат по година, име или категорија, или во сите три полиња истовремено. <br>
    Доколку пребарувањето се изврши со избирање на судот и без пополнување на полињата тогаш се прикажува целосната судска пракса која ја содржи базата на податоци. </span>
<?php break; ?>
<?php case 3: ?>
<span>Граѓанската асоцијација МОСТ ви ја претставува интернет страната <strong><a href="http://www.pravo.org.mk/">www.pravo.org.mk</a></strong>.</span><br>
      <span>
      <br>
      Оваа страна претставува <strong>Правен ресурсен центар</strong>, односно место каде што можат да се најдат законите кои се, но и оние кои повеќе не се во сила, донесени од страна на Собранието на Р Македонија. Во прегледот на истите, вклучени се и сите измени и дополнувања кои се во сила.<br>
        На исто место достапни се и компаративни анализи за закони кои треба да се најдат на дневен ред на собраниските седници, како и судската пракса на Врховниот суд на Р Македонија. <br>
        <br>
      Коментарите, предлозите, иницијативите и размислувањата кои ќе бидат во насока на подобрување на законодавството и одлуките донесени од страна на Собранието се повеќе од добредојдени и истите редовно ќе им бидат доставувани не пратениците, за да им помогнат при одлучувањето. За нивно доставување обезбеден е и лесно достапен линк, кој ги води корисниците директно до местото за пишување. <br>
      <br>
      Правниот ресурсен центар е дел од <strong>Канцеларијата за контакт помеѓу НВОи и Собранието на Р Македонија</strong>, а заедничка цел е институционализирање на соработката помеѓу Собранието од една и граѓаните/ граѓанските организации од друга страна. <br>
      <br>
        Ваквиот интернет сервис ќе обезбеди брз и лесен пристап до законските решенија во државата и ќе има за цел да го поттикне и интензивира дијалогот по законите кои што треба да се донесат. <br>
        <br>
        Страната <a href="http://www.pravo.org.mk/">www.pravo.org.mk</a> претставува уште една алатка во рацете на граѓанските организации и воопшто граѓаните за нивно поактивно вклучување во процесите на донесување одлуки. Повеќе од убедени сме дека истата ќе им биде од корист и на студентите, правниците, новинарите... при извршувањето на нивните секојдневни работни задачи. <br>
        <br>
        Надополнувањето на страната и прибирањето на пристигнатите коментари и предлози ќе се врши секојдневно од страна на тимот на МОСТ. Сите материјали кои се наоѓаат во електронска форма на страната, достапни се и во печатена форма во Канцеларијата за контакт помеѓу НВОи и Собранието на Р Македонија. <br>
        <br>
      Граѓанската асоцијација МОСТ, своите активности ги спроведува со цел да се поттикнат граѓаните активно да се вклучат во демократските процеси. Од друга страна целта на МОСТ е да се обезбеди одговорност, транспарентност и достапност на институциите за граѓаните. Сметаме дека овој интернет сервис ќе придонесе кон остварување на нашите цели.<br>
      <br>
      МОСТ, ја искажува својата благодарност до Шведскиот хелсиншки комитет за човекови права, за разбирањето и поддршката што ни ја даде при реализирање на овој проект.
    </span>
<?php break; ?>
<?php case 4: ?>
<strong>СУДСКА ПРАКСА НА ЕВРОПСКИ СУД ЗА ЧОВЕКОВИ ПРАВА</strong> <br />
    <span><br  />
    Базата на податоци содржи пресуди и одлуки на Европскиот суд за човекови права кои се донесени од ноември 1998 година и истите се распределени во соодветни категории и подкатегории.
    <p>За да може да се пребарува низ базата најпрвин е потребно да се избере категоријата во која конкретната пресуда и одлука се наоѓа. </p>
      <p>Пресудите и одлуките на Европскиот суд за човекови права може да се пребаруваат по година, име или категорија, или нивна комбинација . </p></span>

<?php break; ?>
<?php } ?>
</div>
</div>
<div align="right" style="padding:5px;">
  <input type="submit" name="button" id="button" onclick="JavaScript:window.close();" value="Затвори прозорец" />
</div>
</body>
</html>